publish/my-windows-development-environment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows 下个人开发环境搭建</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="stylesheet" href="https://chinese-fonts-cdn.deno.dev/packages/lxgwwenkai/dist/LXGWWenKai-Regular/result.css" />
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
    <li><a href="https://music.163.com/#/playlist?id=12531191848">Playlist</a></li>
    <li><a href="/_blank.html">_blank</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Windows 下个人开发环境搭建</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org19efd3b">前言</a></li>
<li><a href="#org9b27d05">代理工具</a></li>
<li><a href="#orgb4f3b26">浏览器</a></li>
<li><a href="#orgcea1f1f">Emacs &amp; 环境</a>
<ul>
<li><a href="#org9aa6734">WSL</a></li>
<li><a href="#org43a773f">Windows Terminal</a>
<ul>
<li><a href="#org2c89f43">安装字体</a></li>
<li><a href="#org0e02201">配置 Terminal</a></li>
</ul>
</li>
<li><a href="#orge791ecc">按键绑定</a></li>
<li><a href="#org1fb0664">WSL 和 Windows 之间的复制粘贴</a>
<ul>
<li><a href="#org47a514e">Windows -&gt; WSL</a></li>
<li><a href="#org66945a1">WSL -&gt; Windows</a></li>
</ul>
</li>
<li><a href="#org21afc0b">Ubuntu 环境配置</a>
<ul>
<li><a href="#orga1194d1">Git</a></li>
<li><a href="#org5d77c86">systemd</a></li>
<li><a href="#org61e02ad">zsh</a></li>
<li><a href="#orge651355">NodeJS</a></li>
<li><a href="#orgbcdc66f">Emacs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6b937c4">碎碎念</a></li>
</ul>
</div>
</div>

<div id="outline-container-org19efd3b" class="outline-2">
<h2 id="org19efd3b">前言</h2>
<div class="outline-text-2" id="text-org19efd3b">
<p>
工作关系，公司提供了一台 Windows 电脑进行开发，本来是用 Macbook 的，但懒得上下班来回背，于是就得在 Windows 上配置一下开发环境。
</p>

<p>
这些是我需要用到的一些环境和工具：
</p>

<p>
<code>NodeJS</code> ， <code>Git</code> ， <code>Emacs</code> ， <code>Firefox</code> ， <code>Chrome</code> ， <code>一个好用的终端</code> ， <code>代理工具</code>
</p>
</div>
</div>

<div id="outline-container-org9b27d05" class="outline-2">
<h2 id="org9b27d05">代理工具</h2>
<div class="outline-text-2" id="text-org9b27d05">
<p>
下载 <a href="https://github.com/2dust/v2rayN">2dust/v2rayN</a>，然后配置即可。
</p>

<p>
一开始没有用代理，访问 GitHub 可能比较慢，以后考虑找个 U 盘存储一下， 避免到时访问不了 GitHub 的情况。
</p>
</div>
</div>

<div id="outline-container-orgb4f3b26" class="outline-2">
<h2 id="orgb4f3b26">浏览器</h2>
<div class="outline-text-2" id="text-orgb4f3b26">
<p>
浏览器主要用 <a href="https://www.mozilla.org/en-US/firefox/new/">Firefox</a>,  <a href="https://www.google.com/chrome/">Chrome</a> 也偶尔用。
</p>

<p>
下载 Firefox 时最好通过谷歌寻找下载链接，不然可能下载了国内的版本， 两个版本的账号是不互通的。
</p>
</div>
</div>

<div id="outline-container-orgcea1f1f" class="outline-2">
<h2 id="orgcea1f1f">Emacs &amp; 环境</h2>
<div class="outline-text-2" id="text-orgcea1f1f">
<p>
最开始的时候，是直接下载 Windows 版本的 Git，NodeJS，Emacs，然后用 git bash 作为终端。
</p>

<p>
但是在 Windows 下使用终端实在很别扭，Windows 下的路径和 MacOS，Linux 的不同，不习惯。
</p>

<p>
之后了解到 <a href="https://learn.microsoft.com/en-us/windows/wsl/about">WSL</a> (Windows Subsystem for Linux), 可以通过它在 Windows 上装一个 Linux 子系统。
</p>

<p>
只要安装一个 Ubuntu 或者自己熟悉的 Linux 发行版，就能回到 Linux 那样的命令行环境了。
</p>
</div>

<div id="outline-container-org9aa6734" class="outline-3">
<h3 id="org9aa6734">WSL</h3>
<div class="outline-text-3" id="text-org9aa6734">
<p>
按照 <a href="https://learn.microsoft.com/en-us/windows/wsl/install">Install Linux on Windows with WSL</a> 安装即可，看看文档了解点基本用法。
</p>

<p>
建议使用 Windows 的  <code>Microsoft Store</code> 搜索 wsl 进行安装，然后根据 <a href="https://devblogs.microsoft.com/commandline/systemd-support-is-now-available-in-wsl/">Systemd support is now available in WSL!</a> 配置好 systemd。
</p>
</div>
</div>

<div id="outline-container-org43a773f" class="outline-3">
<h3 id="org43a773f">Windows Terminal</h3>
<div class="outline-text-3" id="text-org43a773f">
<p>
WSL 文档中推荐搭配 <a href="https://github.com/microsoft/terminal">microsoft/terminal</a> 使用，相比于 Powershell，git bash，确实好用很多。
</p>

<p>
它支持了多个 tab，选择不同的 Profiles, 定制主题，字体等。
</p>
</div>

<div id="outline-container-org2c89f43" class="outline-4">
<h4 id="org2c89f43">安装字体</h4>
<div class="outline-text-4" id="text-org2c89f43">
<p>
参考 <a href="https://slmeng.medium.com/how-to-install-powerline-fonts-in-windows-b2eedecace58">How to install Powerline fonts in Windows</a>，步骤如下：
</p>

<ul class="org-ul">
<li>到 <a href="https://github.com/powerline/fonts">powerline/fonts</a> 上，点击克隆的按钮，下载字体 zip 包，下载后解压 zip 包</li>

<li><code>WINDOW KEY + X</code> 选择 <code>Windows PowerShell(Admin)</code>, 然后 cd 到解压的 zip包中 <code>.../fonts-master/fonts-master</code> 目录</li>

<li>执行 <code>Set-ExecutionPolicy Bypass</code> 设置可执行权限，然后执行 <code>.\install.ps1</code> 安装字体， 安装完成后，执行 <code>Set-ExecutionPolicy Default</code> 将权限重置回去</li>
</ul>
</div>
</div>

<div id="outline-container-org0e02201" class="outline-4">
<h4 id="org0e02201">配置 Terminal</h4>
<div class="outline-text-4" id="text-org0e02201">
<ul class="org-ul">
<li>将 Ubuntu 作为默认 Profiles</li>

<li>设置 Ubuntu Profiles 的字体为 Fira, Nerd 之类的字体</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge791ecc" class="outline-3">
<h3 id="orge791ecc">按键绑定</h3>
<div class="outline-text-3" id="text-orge791ecc">
<p>
Windows 有一些默认的全局绑定键，Terminal 里也有一些，按自己需要禁用。
</p>

<p>
目前我的键盘可以直接切换 Ctrl 和 Caps Lock ，但可能有些键盘不支持，可以下载 <a href="https://github.com/microsoft/PowerToys">PowerToys</a> 映射一下。
</p>
</div>
</div>

<div id="outline-container-org1fb0664" class="outline-3">
<h3 id="org1fb0664">WSL 和 Windows 之间的复制粘贴</h3>
<div class="outline-text-3" id="text-org1fb0664">
</div>
<div id="outline-container-org47a514e" class="outline-4">
<h4 id="org47a514e">Windows -&gt; WSL</h4>
<div class="outline-text-4" id="text-org47a514e">
<p>
Windows 上 Ctrl-C 复制，然后可以在 WSL Ctrl-V 粘贴，但是因为我使用 Emacs，Ctrl-V 在 Emacs 中是常用的翻页功能。
</p>

<p>
因此禁用了 Ctrl-V 作为粘贴快捷键，改为通过 Terminal 的 command 去粘贴：
</p>

<p>
在 Ternimal 中 <code>Ctrl+Shift+P</code> 呼出 command panel，然后找到 <code>paste</code> 命令执行即可。
</p>
</div>
</div>

<div id="outline-container-org66945a1" class="outline-4">
<h4 id="org66945a1">WSL -&gt; Windows</h4>
<div class="outline-text-4" id="text-org66945a1">
<p>
同样，在 Terminal 中用 Emacs，选中文字复制没法传递到 Windows 的剪贴板， 目前还没找到方便的操作。
</p>

<p>
当前的解决办法：
</p>
<ul class="org-ul">
<li>Emacs 中选择内容，然后写入到一个文件 <code>~/copy.txt</code></li>

<li>执行命令 <code>cat ~/copy.txt | clip.exe</code> 把 copy 的文本写入剪切板 (可以绑定 alias 方便调用)</li>
</ul>

<p>
将以上流程封装为函数：
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">spike-leung/wsl-copy</span> <span style="color: #dd22dd;">()</span>
  <span style="color: #2a5045;">"Copy region to windows clipboard."</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">interactive</span><span style="color: #dd22dd;">)</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">progn</span>
    <span style="color: #008899;">(</span>write-region <span style="color: #972500;">(</span>mark<span style="color: #972500;">)</span> <span style="color: #972500;">(</span>point<span style="color: #972500;">)</span> <span style="color: #3548cf;">"~/copy.txt"</span> nil nil nil nil<span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span>shell-command <span style="color: #3548cf;">"cat ~/copy.txt | clip.exe"</span><span style="color: #008899;">)</span>
    <span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<p>
之后有时间把这个操作添加到 Emacs 的复制钩子里，这样 Emacs 复制时就能复制到 Windows 上了。
</p>
</div>
</div>
</div>

<div id="outline-container-org21afc0b" class="outline-3">
<h3 id="org21afc0b">Ubuntu 环境配置</h3>
<div class="outline-text-3" id="text-org21afc0b">
</div>
<div id="outline-container-orga1194d1" class="outline-4">
<h4 id="orga1194d1">Git</h4>
<div class="outline-text-4" id="text-orga1194d1">
<p>
Ubuntu 自带，直接用
</p>
</div>
</div>

<div id="outline-container-org5d77c86" class="outline-4">
<h4 id="org5d77c86">systemd</h4>
<div class="outline-text-4" id="text-org5d77c86">
<p>
配置过程中，提示 systemd 不可用，导致一些安装无法进行。
</p>

<p>
参考 <a href="http://wiki.webperfect.ch/index.php?title=WSL:_System_has_not_been_booted_with_systemd_as_init_system_(PID_1)">WSL: System has not been booted with systemd as init system (PID 1)</a> 解决：
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7f0000;"># </span><span style="color: #7f0000;">Install git</span>
sudo apt install git

<span style="color: #7f0000;"># </span><span style="color: #7f0000;">Run the script</span>
git clone https://github.com/DamionGans/ubuntu-wsl2-systemd-script.git
<span style="color: #8f0075;">cd</span> ubuntu-wsl2-systemd-script/
bash ubuntu-wsl2-systemd-script.sh
<span style="color: #7f0000;"># </span><span style="color: #7f0000;">Enter your password and wait until the script has finished</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org61e02ad" class="outline-4">
<h4 id="org61e02ad">zsh</h4>
<div class="outline-text-4" id="text-org61e02ad">
<p>
参考 <a href="https://www.tecmint.com/install-zsh-in-ubuntu/">How to Install and Setup Zsh in Ubuntu 20.04</a>:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7f0000;"># </span><span style="color: #7f0000;">Install</span>
sudo apt install zsh

<span style="color: #7f0000;"># </span><span style="color: #7f0000;">Set zsh as default shell</span>
<span style="color: #7f0000;"># </span><span style="color: #7f0000;">chsh -s $(which "SHELL NAME")</span>
chsh -s $<span style="color: #000000;">(</span><span style="color: #8f0075;">which</span> zsh<span style="color: #000000;">)</span>

<span style="color: #7f0000;"># </span><span style="color: #7f0000;">Uninstall</span>
sudo apt --purge remove zsh
</pre>
</div>

<p>
配置 <a href="https://ohmyz.sh/">Oh My ZSH</a> &amp; <a href="https://starship.rs">Starship</a>, 一些插件参考: <a href="https://github.com/antfu/dotfiles/blob/main/.zshrc">antfu/dotfiles</a>
</p>
</div>
</div>

<div id="outline-container-orge651355" class="outline-4">
<h4 id="orge651355">NodeJS</h4>
<div class="outline-text-4" id="text-orge651355">
<p>
下载 <a href="https://github.com/nvm-sh/nvm">nvm</a> 进行配置：
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7f0000;"># </span><span style="color: #7f0000;">install</span>
curl -o- https://raw.githubusercontent.com/nvm-sh/nvm/v0.39.2/install.sh | bash

<span style="color: #7f0000;"># </span><span style="color: #7f0000;">&#22312; .zshrc &#25110;&#32773; .bashrc &#20013;&#21152;&#20837;&#37197;&#32622;</span>
<span style="color: #8f0075;">export</span> <span style="color: #005e8b;">NVM_DIR</span>=<span style="color: #3548cf;">"$([ -z "${XDG_CONFIG_HOME-}" ] &amp;&amp; printf %s "${HOME}/.nvm" || printf %s "${XDG_CONFIG_HOME}/nvm")"</span>
<span style="color: #000000;">[</span> -s <span style="color: #3548cf;">"$NVM_DIR/nvm.sh"</span> <span style="color: #000000;">]</span> &amp;&amp; <span style="color: #3548cf;">\.</span> <span style="color: #3548cf;">"$NVM_DIR/nvm.sh"</span> <span style="color: #7f0000;"># </span><span style="color: #7f0000;">This loads nvm</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbcdc66f" class="outline-4">
<h4 id="orgbcdc66f">Emacs</h4>
<div class="outline-text-4" id="text-orgbcdc66f">
<p>
默认 apt 安装的是 Emacs 26 的版本，但是我的配置需要 27 以上
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo add-apt-repository ppa:kelleyk/emacs

sudo apt update &amp;&amp; sudo apt upgrade

sudo apt install emacs27

<span style="color: #7f0000;"># </span><span style="color: #7f0000;">Uninstall</span>
sudo apt autoremove --purge emacs27
</pre>
</div>

<p>
安装 gcc，用于编译 emacsql:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt install gcc
</pre>
</div>

<p>
下载自己的 <a href="https://github.com/Spike-Leung/emacs.d">emacs.d 配置</a>，切换成 windows 的分支，注意要安装子模块。
</p>

<p>
如果需要安装最新的 Emacs 版本，可以参考 <a href="https://learnubuntu.com/install-emacs/">How to Install Emacs on Ubuntu</a>:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #7f0000;"># </span><span style="color: #7f0000;">install</span>
sudo apt-add-repository ppa:ubuntu-elisp/ppa

sudo apt update &amp;&amp; sudo apt upgrade

sudo apt-get install emacs-snapshot

<span style="color: #7f0000;"># </span><span style="color: #7f0000;">uninstall</span>
sudo add-apt-repository --remove ppa:ubuntu-elisp/ppa
sudo apt remove emacs-snapshot
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="orgb515bbe"></a>org-mode 打开链接， WSL 中找不到浏览器<br />
<div class="outline-text-5" id="text-orgb515bbe">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #7f0000;">;;; </span><span style="color: #7f0000;">Package --- Summary</span>
<span style="color: #7f0000;">;; </span><span style="color: #7f0000;">init-wsl</span>
<span style="color: #7f0000;">;;; </span><span style="color: #7f0000;">Commentary:</span>
<span style="color: #7f0000;">;;; </span><span style="color: #7f0000;">Code:</span>
<span style="color: #7f0000;">;;; </span><span style="color: #7f0000;">https://adam.kruszewski.name/2017-09-16-emacs-in-wsl-and-opening-links.html</span>

<span style="color: #000000;">(</span><span style="color: #531ab6;">let</span> <span style="color: #dd22dd;">(</span><span style="color: #008899;">(</span>cmd-exe <span style="color: #3548cf;">"/mnt/c/Windows/System32/cmd.exe"</span><span style="color: #008899;">)</span>
      <span style="color: #008899;">(</span>cmd-args <span style="color: #531ab6;">'</span><span style="color: #972500;">(</span><span style="color: #3548cf;">"/c"</span> <span style="color: #3548cf;">"start"</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">when</span> <span style="color: #008899;">(</span>file-exists-p cmd-exe<span style="color: #008899;">)</span>
    <span style="color: #008899;">(</span><span style="color: #531ab6;">setq</span> browse-url-generic-program  cmd-exe
          browse-url-generic-args     cmd-args
          browse-url-browser-function <span style="color: #531ab6;">'</span><span style="color: #0000b0;">browse-url-generic</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>

<span style="color: #000000;">(</span><span style="color: #531ab6;">provide</span> <span style="color: #531ab6;">'</span><span style="color: #0000b0;">init-wsl</span><span style="color: #000000;">)</span>
<span style="color: #7f0000;">;;; </span><span style="color: #7f0000;">init-wsl.el ends here</span>
</pre>
</div>
</div>
</li>

<li><a id="org9aed797"></a>终端没有 GUI，因此一些 GUI 相关的显示会有些问题<br />
<div class="outline-text-5" id="text-org9aed797">
<ul class="org-ul">
<li><b>fringe</b>: 左侧显示的一些标志消失了，flycheck 找不到错误标志，不过可以通过其他方式显示错误，虽然不那么直观，但能接受</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6b937c4" class="outline-2">
<h2 id="org6b937c4">碎碎念</h2>
<div class="outline-text-2" id="text-org6b937c4">
<p>
相对在 Windows 里开发，通过 WSL 用 Ubuntu 进行开发，要舒服很多，一些命令执行起来更方便，速度也不慢。
</p>

<p>
不过仍然存在不少问题需要去解决，例如复制粘贴，还有不少的 Emacs 按键和其他软件似乎有冲突……
</p>

<p>
后面解决了再来更新文章 ：）
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:l-yanlei@hotmail.com">Spike Leung</a></p>
<p class="date">Date: 2022-10-27 Thu 00:00</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<script src="https://giscus.app/client.js"
        data-repo="Spike-Leung/taxodium"
        data-repo-id="MDEwOlJlcG9zaXRvcnkzOTYyNDQwMzk="
        data-category="Announcements"
        data-category-id="DIC_kwDOF540R84Ci61D"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="top"
        data-theme="light_high_contrast"
        data-lang="en"
        data-loading="lazy"
        crossorigin="anonymous"
        async>
</script>
</div>
</body>
</html>
